Repository: HasanKhadd0ur/SAS_Mobile
Catalog: lib/shared/l10n/app_*.arb
Languages: ar

source: Map View
ar: عرض الخريطة

source: Daily Events
ar: الأحداث اليومية

source: Today Summary
ar: ملخص اليوم

source: Topics
ar: المواضيع

source: About
ar: حول

source: FAQ
ar: الأسئلة الشائعة

source: Settings
ar: الإعدادات

source: Theme
ar: المظهر

source: Language
ar: اللغة

# chooseThemeMode
source: Choose your preferred theme mode
ar: اختر وضع المظهر المفضل لديك

# selectLanguage
source: Select your preferred language
ar: اختر اللغة المفضلة لديك

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System
ar: النظام

source: Use light theme
ar: استخدام المظهر الفاتح

source: Use dark theme
ar: استخدام المظهر الداكن

source: Follow system setting
ar: اتباع إعدادات النظام

# aboutScreenTitle
source: About SAS
ar: حول SAS

# aboutSasTitle
source: About SAS
ar: حول SAS

# aboutSasDescription
source: The Situation Awareness System (SAS) is a scalable, microservices-based platform designed to monitor and analyze daily and historical events on an interactive map. By combining social media data scraping, event detection, geolocation inference, and real-time visualization, SAS empowers decision-makers and individuals to stay informed and aware of unfolding situations.
ar: نظام الوعي بالحالة (SAS) هو منصة قابلة للتطوير قائمة على الخدمات المصغرة مصممة لمراقبة وتحليل الأحداث اليومية والتاريخية على خريطة تفاعلية. من خلال الجمع بين كشط بيانات وسائل التواصل الاجتماعي، وكشف الأحداث، واستنتاج الموقع الجغرافي، والتصور في الوقت الفعلي، يتمكن SAS من تمكين صانعي القرار والأفراد من البقاء على اطلاع ووعي بالمواقف المتكشفة.

source: Our Mission
ar: مهمتنا

# missionDescription
source: Our mission is to deliver accurate, timely, and actionable information by leveraging artificial intelligence and deep learning. SAS enhances situational awareness, supports community resilience, and promotes informed decision-making in a rapidly evolving world.
ar: مهمتنا هي تقديم معلومات دقيقة وفي الوقت المناسب وقابلة للتنفيذ من خلال الاستفادة من الذكاء الاصطناعي والتعلم العميق. يعزز SAS الوعي بالحالة، ويدعم مرونة المجتمع، ويعزز اتخاذ القرارات المستنيرة في عالم يتطور بسرعة.

# stayAwareTagline
source: Stay aware. Stay informed.
ar: ابق على اطلاع. ابق مدركاً.

# faqQuestion1
source: Why SAS?
ar: لماذا SAS؟

# faqAnswer1
source: Social media has become a primary source of real-time information. SAS leverages this by continuously scraping and analyzing data from platforms like Telegram and Twitter to identify events as they unfold.
ar: أصبحت وسائل التواصل الاجتماعي مصدرًا رئيسيًا للمعلومات في الوقت الفعلي. يستفيد SAS من ذلك من خلال الكشط والتحليل المستمر للبيانات من منصات مثل Telegram و Twitter لتحديد الأحداث أثناء تطورها.

# faqQuestion2
source: What is SAS?
ar: ما هو SAS؟

# faqAnswer2
source: SAS (Situational Awareness System) is a scalable platform that monitors, detects, and visualizes events using social media data with AI-powered crawlers.
ar: SAS (نظام الوعي بالحالة) هو منصة قابلة للتطوير تراقب وتكتشف وتصور الأحداث باستخدام بيانات وسائل التواصل الاجتماعي مع زاحفات مدعومة بالذكاء الاصطناعي.

# faqQuestion3
source: How does SAS detect events?
ar: كيف يكتشف SAS الأحداث؟

# faqAnswer3
source: SAS leverages deep learning models, natural language processing, and clustering techniques to identify emerging events and determine their geographic locations.
ar: يستفيد SAS من نماذج التعلم العميق ومعالجة اللغة الطبيعية وتقنيات التجميع لتحديد الأحداث الناشئة وتحديد مواقعها الجغرافية.

# faqQuestion4
source: Who can use SAS?
ar: من يمكنه استخدام SAS؟

# faqAnswer4
source: SAS is designed for both the public and decision-makers. General users can explore events, while authorized monitors and analysts can update and verify event details.
ar: تم تصميم SAS للجمهور وصناع القرار على حد سواء. يمكن للمستخدمين العامين استكشاف الأحداث، بينما يمكن للمراقبين والمحللين المخولين تحديث والتحقق من تفاصيل الأحداث.

# faqQuestion5
source: Is SAS free to use?
ar: هل SAS مجاني للاستخدام؟

# faqAnswer5
source: Basic access to the daily event map is open for everyone. Advanced features such as historical data, analytics, and personalized alerts require an account.
ar: الوصول الأساسي إلى خريطة الأحداث اليومية مفتوح للجميع. تتطلب الميزات المتقدمة مثل البيانات التاريخية والتحليلات والتنبيهات المخصصة حسابًا.
